{
  "main": {
    "name": "Rafael Camargos",
    "occupation": "Software Engineer",
    "description": "I have a demonstrated history of working in the information technology and services industry. Strong engineering professional with a Bachelor's degree focused in Mechatronics, Robotics, and Automation Engineering from CEFET-MG, Brazil",
    "image": "profilepic.jpg",
    "bio": "Use this bio section as your way of describing yourself and saying what you do, what technologies you like to use or feel most comfortable with, describing your personality, or whatever else you feel like throwing in.",
    "contactmessage": "Here is where you should write your message to readers to have them get in contact with you.",
    "email": "rafaellucascamargos@yahoo.com.br",
    "phone": "+55-48-991636367",
    "address": {
      "city": "Florianopolis",
      "country": "Brazil",
      "state": "SC",
      "zip": "88034100"
    },
    "website": "https://rcamargos.dev/",
    "resumedownload": "https://rcamargos.dev/",
    "social": [
      {
        "name": "facebook",
        "url": "http://facebook.com/rlcamargos",
        "className": "fa fa-facebook"
      },
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/rcamargos/",
        "className": "fa fa-linkedin"
      },
      {
        "name": "instagram",
        "url": "http://instagram.com/rlcamargos",
        "className": "fa fa-instagram"
      },
      {
        "name": "github",
        "url": "http://github.com/rlcamargos",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "skillmessage": "Here you can create a short write-up of your skills to show off to employers",
    "education": [
      {
        "school": "University",
        "degree": "Bachelor's degree, Mechatronics, Robotics, and Automation Engineering",
        "graduated": "2016",
        "description": ""
      }
    ],
    "work": [
      {
        "company": "Daitan Group",
        "title": "Software Engineer",
        "years": "Jun 2021 - Present",
        "description": "As a software engineer, I help to maintain the security infrastructure of an edge cloud computing software used by the most demanding applications in the industry. Main tech stack: \n • Kubernetes \n • Docker Registry \n • Helm \n • Armada \n • X.509"
      },
      {
        "company": "Brick Abode",
        "title": "Software Engineer",
        "years": "Mar 2019 - May 2021",
        "description": "As a full-stack web developer, I've maintained a high-performance auction house built mainly on Django & React. The roles I've played here: \r • Main Backend Dev & Tech Lead - Implemented: new features, JSON endpoints, API integrations, services, web scraping. Also fixed bugs on a daily basis. \n • Architect - On top of the Django infrastructure I've: designed new features, proposed architecture changes and refactors, implemented code best practices. Also helped to scale the application and make it more testable. \n • DevOps Specialist - Used GitLab CI/CD toolset to orchestrate the code flow from the dev side all the day down to production, lead the migration of the website services to AWS EC2 and RDS, built customized automation tools, set up the system monitoring tools using New Relic, among others activities. \n • QA Analyst - On a daily basis I would check in changes and run tests both manually and automatically to ensure all the requirements criteria are met, the system is functional and there is no weakness. Also contributed to the automated tests infrastructure. \n • Frontend Dev - Built a few React pages that are still production live."
      },
      {
        "company": "Master Internet",
        "title": "Network Operations Analyst",
        "years": "Aug 2018 - Nov 2018",
        "description": "Responsible for constant monitoring of the core network to assure smooth operability. B2B customer service, support, taking care of DDoS attacks, power outages, network failures, and routing black-holes."
      },
      {
        "company": "Gerdau",
        "title": "Mechatronics Engineer Intern",
        "years": "Feb 2017 - Mar 2018",
        "description": "Participated in many initiatives of innovation and improvements in the metallurgical industry, where helped building and maintaining the automation around the plant through the usage of: • Android programming • C++ • Artificial Intelligence - Neural Networks • Computer Vision • PLCs programming"
      }
    ],
    "skills": [
      {
        "name": "Python",
        "level": "100%"
      },
      {
        "name": "Django",
        "level": "90%"
      },
      {
        "name": "Git",
        "level": "90%"
      },
      {
        "name": "Web Development",
        "level": "80%"
      },
      {
        "name": "Android",
        "level": "80%"
      },
      {
        "name": "DevOps",
        "level": "80%"
      },
      {
        "name": "CI/CD",
        "level": "80%"
      },
      {
        "name": "Linux",
        "level": "70%"
      },
      {
        "name": "Docker",
        "level": "60%"
      },
      {
        "name": "Kubernetes",
        "level": "50%"
      }
    ]
  },
  "portfolio": {
    "projects": [
    ]
  },
  "testimonials": {
    "testimonials": [
      {
        "text": "Solid dev, great guy, knocks problems down like there's no tomorrow.",
        "user": "Eduardo Bellani"
      },
      {
        "text": "I have worked with Rafael for about 1 year and a half, initially tutoring him on Python, Django and React, and later working side-by-side solving all sorts of front-end, back-end, and infra structure tasks. Coming from a Mechanical/Electrical Engineer background, the entire web technology was new to him, and he quickly acquired mastery of it. He is a quick learner! Rafael is also eager to assume responsibility and leadership. Back in college he leaded a winning team on a national Robotics competition, and, by the time left the software project we worked together, he was tech leader and designer! Rafael genuinely cares about software quality, best practices, and architectural consistency - concerns which made him teach leader very early on his career. If you are looking for someone to take care of your software project - on all the technological and other tangential aspects associated with it - I recommend you give him a call!",
        "user": "Juarez Aires Sampaio Filho"
      }
    ]
  }
}
